book = {
    'name':'C', 
    'price': 309, 
    'page': 414
    } #Dic จะมาเป็นคู่ก้ต่อเมื่อสร้าง ตัวข้อมูลและข้อมูลแล้ว
print(book['name'])

#การแก่้ไขข้อมูล
book = {
    'name':'C', 
    'price': 309, 
    'page': 414
    } #Dic จะมาเป็นคู่ก้ต่อเมื่อสร้าง ตัวข้อมูลและข้อมูลแล้ว
book['price'] = 500 #ถ้าในข้อมูลเดิมมีข้อมูลที่เราใส่ มันจะแก้ไขข้อมูล
print(book)


#การเพิ่มข้อมูล
book = {
    'name':'C', 
    'price': 309, 
    'page': 414
    } #Dic จะมาเป็นคู่ก้ต่อเมื่อสร้าง ตัวข้อมูลและข้อมูลแล้ว
book['place'] = 500 #ถ้าในข้อมูลเดิมไม่มีข้อมูลที่เราใส่ มันจะเพิ่มขึ้นมาอัตโนมัติ
print(book)



#การลบข้อมูล
book = {
    'name':'C', 
    'price': 309, 
    'page': 414
    } #Dic จะมาเป็นคู่ก้ต่อเมื่อสร้าง ตัวข้อมูลและข้อมูลแล้ว
book.pop('page') 
print(book)



#ตัวแปรทีละตัว ... 
#bookname = 'C'
#bookprice = 309
#book _page = 414

#เก็บไว้ในList
#book_data = [ 'C', 309,414]
