quests = ['ปลูกผัก','ตกปลา','ใส่ปุ๋ย'] #'ปลูกผัก' = 0 ,'ตกปลา' = 1,'ใส่ปุ๋ย' = 2
print(quests[1]) #แสดงผลเควส 1



#แก้ไขข้อมูลภายใน List 
quests = ['ปลูกผัก','ตกปลา','ใส่ปุ๋ย'] #'ปลูกผัก' = 0 ,'ตกปลา' = 1,'ใส่ปุ๋ย' = 2
quests[1] = 'ปลูกมัน' #แก้ไขข้อมูลภายใน List (จากตกปลาเป็นปลูกมัน)
print(quests) 


#ลบ-เพิ่มข้อมูลภายใน List 

#append เพิ่มข้อมูลเข้าไปต่อท้านที่ตำแหน่งสุดท้ายใน List
quests = ['ปลูกผัก','ตกปลา','ใส่ปุ๋ย'] #'ปลูกผัก' = 0 ,'ตกปลา' = 1,'ใส่ปุ๋ย' = 2
quests.append('เลี้ยงไก่') #จะเพิ่มข้อมูลเข้าไปต่อท้านที่ตำแหน่งสุดท้ายใน List
print(quests) 

#insert เพิ่มข้อมูลเข้าไปตำแหน่งที่ระบุ
quests = ['ปลูกผัก','ตกปลา','ใส่ปุ๋ย'] #'ปลูกผัก' = 0 ,'ตกปลา' = 1,'ใส่ปุ๋ย' = 2
quests.insert(1,'เลี้ยงไก่') #จะเพิ่มข้อมูลเข้าไปตำแหน่งที่ระบุ จะมี 2 พารามิเตอร์ พาราแรกคือระบุตำแหน่งที่จะเพิ่มข้อมูล และสองคือข้อมูล
print(quests) 

#remove ลบข้อมูลออกจาก List
quests = ['ปลูกผัก','ตกปลา','ใส่ปุ๋ย'] #'ปลูกผัก' = 0 ,'ตกปลา' = 1,'ใส่ปุ๋ย' = 2
quests.remove('ตกปลา') #ลบข้อมูลออกจาก List 
print(quests) 