quests = ['ปลูกผัก','ตกปลา','ใส่ปุ๋ย'] #'ปลูกผัก' = 0 ,'ตกปลา' = 1,'ใส่ปุ๋ย' = 2
if 'ตกปลา' in quests:
    print('ท่านเข้าเมืองได้')  #เมื่อตัวละครไล่ศัตรูพืชแล้วก็จะมีข้อความแสดงว่าเข้าเมืองได้



#จำกัดเควส
quests = ['ปลูกผัก','ตกปลา','ใส่ปุ๋ย'] #'ปลูกผัก' = 0 ,'ตกปลา' = 1,'ใส่ปุ๋ย' = 2
max_quests = 5 #รับเควสได้สูงสุด 5 เควส
if len(quests) < max_quests:
    quests.append('จับปลาดุก')
    print(quests)



#List combo forloop
quests = ['ปลูกผัก','ตกปลา','ใส่ปุ๋ย'] #'ปลูกผัก' = 0 ,'ตกปลา' = 1,'ใส่ปุ๋ย' = 2
for quest in quests:
    print(quest)
    

#List combo forloop บอกลำดับของเควส คือเลขข้างหน้า
quests = ['ปลูกผัก','ตกปลา','ใส่ปุ๋ย'] #'ปลูกผัก' = 0 ,'ตกปลา' = 1,'ใส่ปุ๋ย' = 2
for i in range(len(quests)):
    print(str(i+1)+ '. ' + quests[i])