# number = 1 
# double = number * 2
# prinr(number)

# number = 2
# double = number * 2
# prinr(number)

# number = 3
# double = number * 2
# prinr(number)

for i in range(3): #range ถ้าอยากให้รับค่าเหมือนด้านบน 3 ครั้งให้ใส่ตัวเลขไป 3  จะเป็น 0 1 2
    print(i) # i จะไปรับค่าจะ 1 เมื่อรับจาก 1 แล้วจะไปรับ 2 รับ 2 แล้วจะไปรับสาม

for i in range(1,3):  #range ถ้าอยากให้รับค่าเหมือนด้านบน 3 ครั้งแต่ไม่ต้องรับ 0 ก็ใส่ เลข 1 ข้างหน้าคือค่าเริ่มต้น และเลข 3 คือค่าสิ้นสุเ
    print(i) # i 1 2

for i in range(1,4): #range ถ้าอยากให้รับค่าเหมือนด้านบน 3 ครั้งแต่ไม่ต้องรับ 0 ก็ใส่ เลข 1 ข้างหน้าคือค่าเริ่มต้น และเลข 4  ค่าสิ้นสุด
    print(i) # i = 1 2 3

for i in range(2, 10, 2): #range รับค่าเริ่มต้นจาก 2 นับไปถึงจำนวนที่ 10 เพิ่มทีละ 2
    print(i) #2 4 6 8 


for i in range(1,4): #range ถ้าอยากให้รับค่าเหมือนด้านบน 3 ครั้งแต่ไม่ต้องรับ 0 ก็ใส่ เลข 1 ข้างหน้าคือค่าเริ่มต้น และเลข 4  ค่าสิ้นสุด
    double = i * 2 # i อยู่ใน 1 2 3 แล้วคูณด้วย 2
    print(double) #6

#coutinue
for i in range(1,7):
    if i % 3 == 0: # หาร 3 แล้วได้เศษ 0 โปรแกรมจะเข้ามาเจอ continue เลยจะข้าม Loop i%3==0
        continue
    print(i) #1245

#break
for i in range(1,7):
    if i % 3 == 0: # หาร 3 ลงตัวเลยไม่แสดง โปรแกรมจะเข้ามาเจอ continue เลยจะหยุดการทำงานตั้งแต่นั้น
        break
    print(i) #12